# Core completions (load early)
zsh-users/zsh-completions

# Oh-my-zsh libs we still want (cherry-picked)
ohmyzsh/ohmyzsh path:lib/completion.zsh
ohmyzsh/ohmyzsh path:lib/history.zsh
ohmyzsh/ohmyzsh path:lib/key-bindings.zsh

# Useful OMZ plugins (lightweight ones only)
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/kubectl

# fzf-tab (must load after compinit, before autosuggestions)
Aloxaf/fzf-tab

# Fish-like features
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search

# Git enhancements
wfxr/forgit

# Abbreviations (fish-style)
olets/zsh-abbr kind:defer

# Remind you when an alias exists for a command
MichaelAquilina/zsh-you-should-use

# Auto-pair brackets, quotes, parentheses
hlissner/zsh-autopair

# Syntax highlighting (MUST be last)
zdharma-continuum/fast-syntax-highlighting kind:defer
